package com.example.tafang.other;

import com.example.tafang.model.Buff;

import java.util.ArrayList;
import java.util.List;

import static com.example.tafang.other.Data.money;

public class CreateFD {
    public static int cfenshu=0;//建造飞碟 每次移动的份数
    public static int zidan=100;
    public static int zidan2=50;
    public static int zidan3=50;
    public static int jzfdx,jzfdy;//建造飞碟的x y
    public static int isjz=0;//建造飞碟状态 1开始-飞行到目的地 2建造 0建造完毕
    public static int isjz2=0;
    public static int jzjdt=0;//建造进度条
    public static int quanpignpaodan=0;//全屏炮弹
    public static int qflag=0;//全屏炮弹
    public static int isgetpao=1;//全屏炮弹是否都爆炸完毕 0否 1是
    public static int boshu=0;//怪物波束
    public static int lapudacd=400;//拉普达 cd
    public static int lapudatime=200;//拉普达 持续时长
    public static int yibojieshu=0;//一波结束1 重置0 -1未开始
    public static List<Buff> buffList=new ArrayList<>();//buff lsit
    public static List<Buff> buffList2=new ArrayList<>();//buff 存储随机的Buff
    public static int ta1gj1=2;//塔1攻击1
    public static int ta1gj2=5;//塔1攻击2
    public static int ta1gj3=8;//塔1攻击3
    public static int ta2gj1=3;//塔2攻击
    public static int ta2gj2=6;//塔2攻击
    public static int ta2gj3=9;//塔2攻击
    public static int ta3gj1=3;//塔3攻击1
    public static int ta3gj2=6;//塔3攻击2
    public static int ta3gj3=9;//塔3攻击3
    public static int shuaxinflag=0;//0不显示 1显示
    public static int zidongxuanze=0;//自动选择 0-30
    public static int shuxingflag=0;//0不显示 1显示
    public static int jsxingzoutime=0;
    public static int jsfx=0;
    public static int ptgj=0;//英雄普通攻击扣血
    public static int yxx,yyy;//英雄 x y坐标
    public static int gameAll=1;//全局 1游戏存活
    public static int gwnowx=0;//英雄攻击目标的x
    public static int gwnowy=0;//英雄攻击目标的y
    public static int yxkx=0;//英雄扣血
    public static int yxkxid=0;//英雄扣血id
    public static int[][] amap1={// 4上转弯 6上 638上右转 526左下转
            {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
            {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
            {0,0,0,0,0,0,0,0,3,3,3,8,8,8,8,8,8,8,8,2,2,0,0,0,0,0,0,0,0,0,0,0},
            {0,0,0,0,0,0,0,0,3,3,3,8,8,8,8,8,8,8,8,2,6,0,0,0,0,0,0,0,0,0,0,0},
            {1,5,5,5,5,5,5,5,5,5,6,0,0,0,0,0,0,0,6,6,6,0,0,0,0,0,0,0,0,0,0,0},
            {1,5,5,5,5,5,5,5,5,4,4,0,0,0,0,0,0,0,6,6,6,0,0,0,0,0,0,0,0,0,0,0},
            {1,5,5,5,5,5,5,5,5,4,4,0,0,0,0,0,0,0,6,6,6,0,0,8,8,8,8,8,8,8,8,0},
            {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,3,3,3,8,8,8,8,8,8,8,8,8,8,0},
            {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,8,8,8,8,8,8,8,8,8,8,8,8,8,0},
            {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
            {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
            {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
            {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
            {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
    };//H行W列
    public static int[][] amap2={
            {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
            {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
            {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,3,3,8,8,8,8,8,8,2,2,0,0,0,0,0},
            {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,6,6,8,8,8,8,8,8,2,2,0,0,0,0,0},
            {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,6,6,0,0,0,0,0,6,6,6,0,0,0,0,0},
            {0,0,0,0,0,0,0,3,3,8,8,8,8,8,8,8,8,4,4,0,0,0,0,0,3,3,3,8,8,8,8,0},
            {0,0,0,0,0,0,0,6,3,8,8,8,8,8,8,8,8,4,4,0,0,0,0,0,3,3,3,8,8,8,8,0},
            {1,5,5,5,5,5,5,6,6,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
            {1,5,5,5,5,5,5,4,4,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
            {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
            {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
            {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
            {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
            {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
    };//H行W列
    public static int[][] amap3={
            {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
            {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
            {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,3,8,8,8,8,0},
            {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,6,6,0,0,0,0},
            {1,5,5,5,5,5,5,5,5,5,5,5,5,5,2,2,0,0,0,0,0,0,0,0,0,0,6,6,0,0,0,0},
            {1,5,5,5,5,5,5,5,5,5,5,5,5,5,2,2,0,0,0,0,0,0,0,0,0,0,6,6,0,0,0,0},
            {0,0,0,0,0,0,0,0,0,0,0,0,0,6,6,6,0,0,0,0,0,0,0,0,0,0,6,6,0,0,0,0},
            {0,0,0,0,0,0,0,0,0,0,0,0,0,6,6,6,0,0,0,0,0,0,0,0,0,0,6,6,0,0,0,0},
            {0,0,0,0,0,0,0,0,0,0,0,0,0,6,3,8,8,8,8,8,8,8,8,8,8,8,4,6,0,0,0,0},
            {0,0,0,0,0,0,0,0,0,0,0,0,0,6,8,8,8,8,8,8,8,8,8,8,8,8,8,8,0,0,0,0},
            {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
            {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
            {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
            {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
    };//H行W列
    public static void chushihua(){
        cfenshu=0;//建造飞碟 每次移动的份数
        zidan=100;
        zidan2=50;
        zidan3=50;
        isjz=0;//建造飞碟状态 1开始-飞行到目的地 2建造 0建造完毕
        isjz2=0;
        jzjdt=0;//建造进度条
        quanpignpaodan=0;//全屏炮弹
        qflag=0;//全屏炮弹
        isgetpao=1;//全屏炮弹是否都爆炸完毕 0否 1是
        boshu=0;//怪物波束
        lapudacd=400;//拉普达 cd
        lapudatime=200;//拉普达 持续时长
        yibojieshu=0;//一波结束1 重置0
        List<Buff> buffList=new ArrayList<>();//buff lsit
        List<Buff> buffList2=new ArrayList<>();//buff 存储随机的Buff
        ta1gj1=2;//塔1攻击1
        ta1gj2=5;//塔1攻击2
        ta1gj3=8;//塔1攻击3
        ta2gj1=4;//塔2攻击
        ta2gj2=7;//塔2攻击
        ta2gj3=10;//塔2攻击
        ta3gj1=3;//塔3攻击1
        ta3gj2=6;//塔3攻击2
        ta3gj3=9;//塔3攻击3
        shuaxinflag=0;//0不显示 1显示
        zidongxuanze=0;//自动选择 0-30
        shuxingflag=0;//0不显示 1显示
        jsxingzoutime=0;
        jsfx=0;
        ptgj=0;//英雄普通攻击扣血
        gameAll=1;//管 每关结束后的弹出框是否显示
        money=5000;//金币初始化
        SelectMap.map1=amap1;//初始化地图
        SelectMap.map2=amap2;
        SelectMap.map3=amap3;
    }
}
